#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//算数操作符

//int main()
//{
//	/*int a = 6 / 5;
//	printf("%d", a);*/
//
//	/*float a = 6 / 5;
//	printf("%f", a);*/
//	
//	float a = 6.0 / 5;//打印小数，至少保证除数和被除数有一个是浮点数
//	printf("%f", a);
//
//	return 0;
//}

//int main()
//{
//	int a = 7 % 3;//模两端必须是整数
//	return 0;
//
//}


//int main()
//{
//	int a = 2;
//	//把a的二进制位向左移动一位
//	int b = a << 1;
//	//当前右移操作符是：算术右移
//	printf("b=%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//	// ^ - 按（2进制）位异或
//	//对应二进制位异或
//	//规则：相同为0，相异为1
//	int c = a ^ b;
//	// 
//	//00000000 00000000 00000000 00000011 - 3
//	//00000000 00000000 00000000 00000101 - 5
//	//00000000 00000000 00000000 00000110 - 6
//	
//	// | - 按（2进制）位或 - 合并（有1为1，都为0为0）
//	//int c = a | b;
//	// 
//	//00000000 00000000 00000000 00000011 - 3
//	//00000000 00000000 00000000 00000101 - 5
//	//00000000 00000000 00000000 00000111 - 7
//
//	//& - 按（2进制）位与 - 合并（有0为0，都为1为1）
//	//int c = a & b;
//	// 
//	//00000000 00000000 00000000 00000011 - 3
//	//00000000 00000000 00000000 00000101 - 5
//	//00000000 00000000 00000000 00000001 - 1
//
//
//	return 0;
//}

int main()
{
	int a = 0;
	int n = 0;
	scanf("%d", a);
	//00000000 00000000 00000000 00001101
	//
	int i = 0;
	for (i = 1;i <= 32;i++)
	{
		int b = a & 1;
		if (b == 1)
		{
			n++;
		}
		a = a >> 1;
	}
	printf("二进制含1的个数为：%d", n);
	return 0;

}
